const passage2=
`
<div class="div_class" >
  <h1 style="text-align:center;line-height:1.7em;">我们的功能理念</h1>
  <b style="color:red;">长文预警，建议分段查看，你想要详细了解哪个部分，你就可以去哪个部分，其他部分可以先不看</b>
  <h2 style="text-align:center;line-height:1.7em;">反思-自我迭代</h2>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  何谓“反思”？它指思考过去的事情，从中总结经验教训。哲学家西塞罗在《论老年》中又这样一句话：“我希望能够获得唯有作家才有的特权——在‘再版’的生活中修正‘初版’的错误。生活的悲哀之处在于我们总是老得太快而又聪明得太慢。”少有人事事顺心，多的是遗憾唏嘘，反思无法让我们回到过去，但能尽量降低我们再犯过去的错误的概率。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  我们小程序的反思功能，是受美国心理学家J.H.弗拉维尔提出的元认知概念的启发。元认知（Thinking about thinking）主要包含两方面的内容，一方面是有关认知的知识实体，另一方面是对认知活动的调节过程，被认为是认知活动的核心。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  研究表明，婴儿出生以后就有了一定的认知能力，而到了学前期才开始获得一些零星的、肤浅的元认知能力，这时元认知能力才开始发展。而在大学生中，元认知能力存在着极大的个体差异，通过加强对元认知的学习和培养，能使我们的元认知能力获得迅速发展和提高。
  </p>
  <div style="margin: 0 auto; text-align: center;"> <img src="https://s1.imagehub.cc/images/2020/11/25/a605ad238972c7f3bf707adc85bf473c.png" style="width:320px;"/> </div>
  <div>&nbsp;</div>
  <p class="p" style="text-indent:2em;line-height:1.7em;"></div>
  由于移动互联网普及，内容创作和传播的门槛大大降低，大量有销售目的的知识、具有欺骗性的谣言、没有营养的八卦随处可见，霸占着我们的手机屏幕，期待着进入我们的大脑，让我们的意识海洋浑浊，思考方式简单粗暴。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  我们常说自己要反思，要反思，但反思的结果常常只是回顾而非总结。满目艳羡地看着别人丰富多彩的活动经历，分数漂亮的试卷作业，只萌生“我应该更努力”的想法，却不思考“我应该怎么更努力”的所谓反思，略显单薄，无甚大用。我们不能满足于浅尝辄止，要学会全面、客观、深入的思考，努力踏出舒适圈，打破自己的思维定势。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  看一部电影，只有落幕之后，我们才能对剧中的情节桥段进行客观公正的评价；写一篇文章，只有落笔之后，我们才能发现自己之前情节、描写和逻辑中的不足。所以我们鼓励大家观察自己每天的行为，争取“吾日三省吾身”，积极反思来提出调整措施，从而在下次行动中进行更加明智的决策。通过主动督促自己进行元认知，可以帮助我们调整行为，修正认知，不断迭代循环这个过程，让行和知更好地保持动态平衡。
  </p>
  <h2 style="text-align:center;line-height:1.7em;">微习惯</h2>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
    何谓“习惯”？它是我们习以为常的行为，是积久而成的生活方式，而人生也正是无数习惯的总和。一个人的好习惯会让他受益无穷，坏习惯则可能是毁灭他的炸弹。作为当代大学生，提高竞争力是每个人得奋斗目标，良好习惯对提高效率至关重要。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  培养习惯就好像希腊神话人物西西费斯每天重复推着石头上山一样。一开始觉得新鲜好玩，但长时间的推上滚落，循环往复，永无止境，又让人心生不耐；真正熬过惫懒期，它才能慢慢变成你生活的必需品。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  我们常常有雄心壮志：21天内，我要养成xx好习惯。但理想很丰满，现实很骨感，向周而复始的日程表中添加新事件并不像我们想象中那么容易。有些人的小目标在半途中为其他“优先级”一退再退，因“充分”的理由折戟沉沙；有些人坚持一个所谓养成周期后却发现改变效果并不持久，于是对自身产生怀疑。或许，并不是我们本身有问题，而是我们的策略不够好。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  基于这种情况，美国作家斯蒂芬·盖斯提出“微习惯”概念。微习惯是一种非常微小的积极行为，它微小到你不费吹灰之力就能把他做好，不会因为特殊情况就被你轻易放弃，也没有具体的截止日期。可能很多人认为，养成好习惯要艰苦的努力，或短期的强化训练。但微习惯打破了这种认知，它不会给你造成任何负担，不吃苦也能养成好习惯；它具有超强的“欺骗性”，容易让人获得愉悦感、成就感和自我效能感，是一种极具优势的习惯养成策略。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  从生理层面看，大脑可分为两个部分：潜意识部分（愚蠢的重复者）和意识部分（聪明的管理者）。重复者以基底神经节区域为结构基础，它不会分辨对错，无需持续监督就能自动重复工作，节省精力且效率高；管理者则基于前额皮层区域，可以理解长远利益，负责处理短期思维和决策，反应灵敏但消耗大量精力和意志力。微习惯成功正是建立在这些特点上。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  从2012年末开始，斯蒂芬·盖斯每天至少做1个俯卧撑，这成了他培养的第一个微习惯。两年后，他拥有了梦想中的体格，写的文章是过去的4倍，读的书是过去的10倍。那么我们为什么不能从一个微习惯开始，打开美妙人生？
  </p>
  <h2 style="text-align:center;line-height:1.7em;">正念专注</h2>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  何谓“专注”？它指人全神贯注，集中全部精力去完成某件事的状态。何谓“专注力”？我们可以将其理解为一种认知活动的动力功能，某种程度上可以说我们记忆、思维、想象、执行、反馈等活动开展得推动力正是专注力。日益强调“自主学习”“终身学习”的当下，控制好自己的“专注”开关是我们应该具备的能力。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  信息爆炸的时代，智能设备便利了我们生活，但从中传来的即时信息无形中使我们更容易分心。班级和其他组织的事务通知，朋友的聚餐邀约，闺蜜的吐槽，兄弟的谈天，电话消息此起彼伏；淘宝京东的促销优惠，微博知乎的热搜推送，各类APP争奇斗艳……如何突破重围，开辟专注天地，成为困扰许多人的问题。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  不同于各种学习软件中监督大家专注过程的“番茄钟”，我们希望能提出一种帮助大家进入专注状态，开启学习模式的简单方法——正念数息。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  正念数息起源于佛教禅宗的冥想，是一种随时可进行，随处可进行的集中注意力的方式，我们借助呼吸与外部世界建立联系，通过感受气流的变化将放马平原的思绪收拢于心，让呼出的气息带走脑内无关的杂念。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  除了帮助人进入专注，正念数息的长期益处还有很多。首先，心理上，它能放大快乐，减轻压力。大脑左右对于情绪感知不同，简单来说就是左脑感知正向情绪，右脑感知负向情绪。根据有关实验数据，数息能帮助我们降低感知正向情绪的阈值，而提高感知负向情绪的阈值。其次，生理上，它能通过减少负面情绪而降低与压力相关的病症发生率改善休息与睡眠；其次，它能完善人的性格，使人更富有同情心与爱心，更好的捕捉内部和外部的真诚善意。
  </p>
  <p class="p" style="text-indent:2em;line-height:1.7em;">
  不需要特别的器具，不需要特别的饰物，不需要特别的动作，无论你是在图书馆的自习座位、即将响起上课铃的教室，还是在喧闹嘈杂的食堂、熄灯安谧的寝室，你都能跟随正念数息法呼吸——只要你想专注。
  </p>
</div>
`
const app= getApp()
Page({
  data: {
    passage2,
    show:true,
    list2:[1,0,1], //用于存储显示那个文章的，默认显示反思,因为是用hide所以要反着
  },
  onLoad: function (options) {
    // 注意神坑，一旦传入list[i]之后动态改变数组是不会动态html中list[i]所以必须后来再创建数组
    var temp=[];
    for(let i=0;i<3;i++)
    {
      if(i==app.globalData.p_index) temp[i]=true
      else temp[i]=false
    }
    this.setData({
      list:temp
    })
  },
  // 实现页面的隐藏以及显示
  navg(e){
    var index = ~~e.currentTarget.dataset.index
    var list=[1,1,1]
    list[index]=0;
    this.setData({
      list2:list
    })
  },
  onShareAppMessage() {
    return {
      title: '攀登者',
      path: '/pages/index/index'
    }
  },
  // 放大图片
  show_picture(e){
    wx.previewImage({
      urls:[e.currentTarget.dataset.src],
    })
  }
})